_posts/2016-03-28-fundamental-theorem-arithmetic.html
---
layout: post
title: "Fundamental Theorem of Arithmetic"
date: 2016-03-28
comments: true
theorems: true
tags: theorems maths
excerpt: A short description of the fundamental theorem of arithmetic.
---

<p>
The <b>fundamental theorem of arithmetic</b> in number theory states that
every positive integer number greater than 1, $x &isin; \mathbb{Z} where
\(x > 1\), is a prime number or it is comprised of the unique product of
prime numbers up to the order of the factors.
</p>

<p>
<b>Example:</b>
</p>

<p>
\(1250 = 2^{1} \times 5^{4} = 2\times 5\times 5\times 5\times 5\\\)
\(1200 = 3^{1}\times 5^{2}\times 2^{4} = 3\times 5\times 5\times
2\times 2\times 2\times 2\\\)
</p>

<p>
<b>In other words:</b>
</p>
<ol class="org-ol">
<li>1250 and 1200 can be represented as a product of primes</li>
<li>there will always be a specific amount of primes in each product</li>
</ol>


<p>
<b>Proof:</b>
</p>

<p>
Using <b>Euclid's lemma</b> and <b>B`ezout's identity</b>. Let \(p\) be a
prime. Assume \(p\) divides the product of two integers \(a\) and \(b\)
written as \((p|ab)\), and its negation is \(\not (p|ab)\).
</p>

<p>
Then either \(p\) divides \(a\) \((p|a)\) or \(p\) divides \(b\) \((p|b)\) or
both. Some equivalent statements:
</p>

<ul class="org-ul">
<li>if \(\not (p|a)\) and \(\not (p|b)\), then \(\not (p|ab)\).</li>
<li>if \(\not (p|a)\) and \((p|ab)\), then \((p|b)\).</li>
</ul>

<p>
Generalization of <b>Euclid's lemma</b> from prime numbers to any integers:
</p>


<ul class="org-ul">
<li>if \((n|ab)\), and \(n\) shares no common divisors other than 1 with
\(a\), then \((n|b)\).</li>
</ul>

<p>
If \(n\) is prime, either:
</p>

<ul class="org-ul">
<li>\((n|a)\) or</li>
<li>\(n\) shares no common divisors other than 1 (i.e. relatively prime)
with a, therefore, \(\not (n|a)\) so \((n|b)\).</li>
</ul>

<p>
Thus, this is a generalization.
</p>


<p>
<b>B`ezout's identity</b> states that if \(a\) and \(b\) share no common
 divisor other than 1 (i.e. are relatively prime integers) then there
 exist integers \(\delta\) and \(\gamma\) such that:
</p>

<p>
\(\delta a + \gamma b = 1\).
</p>

<p>
Let a and b share no common divisor other than 1, and assume that
\((n|ab)\). According to <b>B`ezout's identity</b> there exist \(\delta\) and
\(\gamma\) which provide:
</p>

<p>
\(\delta n + \gamma a = 1\).
</p>

<p>
Multiplying both sides by \(b\):
</p>

<p>
\(\delta nb + \gamma ab = b\).
</p>

<p>
\(\delta nb\) is divisible by \(n\) and \(\gamma ab\) is divisible by \(ab\)
which in turn is also divisible by \(n\) as we state above in our
assumption.
</p>

<p>
Therefore, since we have shown that both terms in the addition of
\(\delta nb + \gamma ab\) are divisible by \(n\) then it must be true that
their sum \(b\), is also divisible by \(n\).
</p>

<p>
This is also a generalization to <b>Euclid's lemma</b> mentioned above.
</p>
